app/Http/Controllers/DashboardController.php

select * from `areas` where `areas`.`id` in (1, 2, 3, 4, 5, 6)
select `area_id`, count(*) as total from `tasks` group by `area_id`
---
    public function adminDashboard()
    {
        $users = User::all();
        $tasks = Task::with('area')->get();

select * from `tasks` where `due_date` < '2024-10-20 15:06:14'
---
    public function reportsDashboard()
{
    // Obtener las tareas próximas a vencer
    $upcomingTasks = Task::where('due_date', '>', now())
        ->orderBy('due_date')
        ->take(5)
        ->get();