app/Http/Controllers/UserController.php

    public function index()
    {
        $users = User::all(); // Obtener todos los usuarios
---
select * from `users`